let news = [
    {
        title: 'Найактуальніші новини міста, громади та країни щогодини!',
        description: 'З понеділка по п’ятницю ведучі новин Ірина Карвацька та Марія Канцелярист готують актуальні випуски найважливіших подій міста, громади та країни',
        date: 'Актуальні новини щогодини з <i>8:00</i> до <i>19:00</i>',
    },

    {
        title: 'Ранкове шоу «Не Спати» з Дмитром Дзіковським та Софією Труш! ',
        description: 'Енергійне ранкове шоу з цікавими рубриками, актуальними темами, премʼєрами нових треків та спілкуванням з українськими зірками, що триває з 8:00 до 12:00 ',
        date: 'Щобудня з <i>8:00</i> до <i>12:00</i>',
    },

    {
        title: 'Прямі ефіри з міським головою! ',
        description: 'Розмова із міським головою, де мер у прямому ефірі відповідає на ті питання, що найбільше турбують мешканців громади ',
        date: 'Раз на <i>2-3</i> місяці ',
    },

    {
        title: "Проєкт «Янтерв'ю» ",
        description: 'У студію Yantarne.FM кожного тижня приходять представники влади, освіти, здоровʼя, спорту та інших структур громади. А також військові, волонтери, підприємці чи інші цікаві люди громади, які розповідають про себе та свою діяльність у форматі інтерв’ю',
        date: 'Щотижня у <i>середу</i>',
    },

    {
        title: "Авторські музичні мікси від DJ StasON!",
        description: "Кожного вечора з понеділка по п'ятницю в ефірі звучать унікальні музичні мікси від DJ StasON. О 21:00 стартує UKR MIX - ціла година сучасних українських хітів, а о 22:00 DANCE MIX - драйвовий музичний сет кращих закордонних хітів",
        date: 'Щодня з <i>21:00</i> до <i>23:00</i>',
    },

    {
        title: 'FDR Media: Топ-10 нових українських треків',
        description: "Прем'єра Топ-10 найсвіжіших українських треків ",
        date: 'Кожної суботи о <i>17:00</i>',
    },

    {
        title: 'Проєкт «Слухоманія» ',
        description: 'Кожної неділі українські музиканти представляють нові релізи та музику для своїх прихильників ',
        date: 'Щонеділі о 12:00',
    },

    {
        title: 'Радіо Чарт Топ-40 ',
        description: 'Українські музиканти діляться найновішою музикою! Рейтинг найротованіших пісень українського радіопростору ',
        date: 'Кожної неділі о <i>16:00</i>',
    },
]

const news_frame = document.getElementById('news_frame')
const template = document.getElementById('news_template')

for (let i = 0; i <= news.length - 1; i++) {
    let card = template.cloneNode(true)
    let top = card.querySelector('.top')
    let title = top.querySelector('.title-text')
    let descript = card.querySelector('#desciipt')
    let date = card.querySelector('#date')

    title.textContent = news[i].title
    descript.textContent = news[i].description
    date.innerHTML = news[i].date
    card.style.display = 'flex'
    
    news_frame.appendChild(card)
}